# Aggregation & Grouping

Grouping and aggregating helps you **summarize your data** — like answering:  
> “What’s the average salary *per department*?”  
> “How many users joined the Gym *per month*?”

---

## `.groupby()` Function

df.groupby() is used to group rows of a DataFrame based on the values in one or more columns, which allows you to then perform aggregate functions (like sum(), mean(), count(), etc.) on each group.
Consider this DataFrame:

```python 
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})  

```

```python
df.groupby("Department")["Salary"].mean()
```

This says:  
> “Group by Department, then calculate average Salary for each group.”

---

## Common Aggregation Functions

```python
df.groupby("Team")["Salary"].mean()     # Average per team
df.groupby("Team")["Salary"].sum()      # Total score
df.groupby("Team")["Salary"].count()    # How many entries
df.groupby("Team")["Salary"].min()
df.groupby("Team")["Salary"].max()
```

To group by multiple columns:

```python
df.groupby(["Team", "Gender"])["Salary"].mean()
```

---

## Custom Aggregations with `.agg()`

Apply **multiple functions** at once like this:

```python
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])
```
In pandas, .agg and .aggregate are exactly the same — they're aliases for the same method

Name your own functions:

```python
df.groupby("Team")["Salary"].agg(
    avg_score="mean",
    high_score="max"
)
```

Apply different functions to different columns:

```python
df.groupby("Team").agg({
    "Salary": "mean",
    "Age": "max"
})
```

---

## Transform vs Aggregate vs Filter

| Operation | Returns | When to Use |
|-----------|---------|-------------|
| `.aggregate()` | Single value per group | Summary (like mean) |
| `.transform()` | Same shape as original | Add new column based on group |
| `.filter()`    | Subset of rows | Keep/discard whole groups |

### `.transform()` Example:

```python
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")
```

Now each row gets its **team average** — great for comparisons!

### `.filter()` Example:

```python
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)
```

Only keeps teams with average score > 80.

---

## Summary

- `.groupby()` helps you summarize large datasets by category  
- Use `mean()`, `sum()`, `count()`, `.agg()` for custom metrics  
- `.transform()` adds values back to original rows  
- `.filter()` keeps only groups that meet conditions

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85000, 90000, 78000, 85000, 92000, 88000, 75000, 80000],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [3]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M   85000   23 2020-01-10
1         HR    A      F   90000   25 2020-02-15
2         IT    B      M   78000   30 2021-03-20
3         IT    B      F   85000   22 2021-04-10
4  Marketing    C      M   92000   28 2020-05-30
5  Marketing    C      F   88000   26 2020-06-25
6      Sales    D      M   75000   21 2021-07-15
7      Sales    D      F   80000   27 2021-08-01

In [4]:
df.groupby("Department")["Salary"].mean()

Department
HR           87500.0
IT           81500.0
Marketing    90000.0
Sales        77500.0
Name: Salary, dtype: float64

In [5]:
type(df.groupby("Department")["Salary"].mean())

pandas.core.series.Series

In [6]:
df.groupby("Department")["Salary"].sum()

Department
HR           175000
IT           163000
Marketing    180000
Sales        155000
Name: Salary, dtype: int64

In [7]:
df.groupby("Department")["Salary"].count()

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [8]:
df.groupby("Department")["Salary"].min()

Department
HR           85000
IT           78000
Marketing    88000
Sales        75000
Name: Salary, dtype: int64

In [9]:
df.groupby("Department")["Salary"].max()

Department
HR           90000
IT           85000
Marketing    92000
Sales        80000
Name: Salary, dtype: int64

In [10]:
df.groupby("Department")["Salary"].agg(["mean", "max", "min", "count"])

               mean    max    min  count
Department
HR          87500.0  90000  85000      2
IT          81500.0  85000  78000      2
Marketing   90000.0  92000  88000      2
Sales       77500.0  80000  75000      2

In [11]:
type(df.groupby("Department")["Salary"].agg(["mean", "max", "min", "count"]))

pandas.core.frame.DataFrame

In [12]:
df.groupby("Team")["Salary"].agg(
    avg_score="mean",
    high_score="max"
)

      avg_score  high_score
Team
A       87500.0       90000
B       81500.0       85000
C       90000.0       92000
D       77500.0       80000

In [13]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")

In [14]:
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M   85000   23 2020-01-10   87500.0
1         HR    A      F   90000   25 2020-02-15   87500.0
2         IT    B      M   78000   30 2021-03-20   81500.0
3         IT    B      F   85000   22 2021-04-10   81500.0
4  Marketing    C      M   92000   28 2020-05-30   90000.0
5  Marketing    C      F   88000   26 2020-06-25   90000.0
6      Sales    D      M   75000   21 2021-07-15   77500.0
7      Sales    D      F   80000   27 2021-08-01   77500.0

In [15]:
df.groupby("Team").filter(lambda x:x["Salary"].mean() > 85000)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M   85000   23 2020-01-10   87500.0
1         HR    A      F   90000   25 2020-02-15   87500.0
4  Marketing    C      M   92000   28 2020-05-30   90000.0
5  Marketing    C      F   88000   26 2020-06-25   90000.0